// 正则枚举对象
export const RegexEnum = {
    ISACCOUNT: /^[\u4E00-\u9FA5A-Za-z0-9]{3,10}$/,  //至少输入三到十位任意字符
    ONLYNUMBER: /^[0-9]{5,20}$/, //5-20位纯数字
    ONLYLETTER: /^[a-zA-Z]{5,20}$/, //5-20位纯字母
    ONLYUNDERLINE: /^[_]{5,20}$/, //5-20位纯下划线
    USERNAME: /^[a-zA-Z0-9_\u4e00-\u9fa5]{5,20}$/, // 用户名格式,5-20位汉字数字字母下划线组合
    USERNAME2: /^[a-zA-Z0-9_]{5,20}$/, // 用户名格式,5-20位数字字母下划线组合
    // USERNAME: /[`~!@#$%^&*()_+<>?:"{},.\/;'[\]]/im,
    ISMOBILE: /^1\d{10}$/, // 手机号码格式
    ISHKMOBILE: /^[69]\d{7}$/, // 香港手机号码格式
    ISPWD: /^[A-Za-z0-9*#]{6,18}$/, // 密码格式
    LOWPWD: /(^\d+$|^[a-z]+$|^[A-Z]+|\s$)/, // 弱密码格式
    HIGHPWD: /^(?=.*\d)(?=.*[a-z])(?=.*[A-Z])([\*|#]?).{6,18}$/, // 强密码格式
    MILEAGE: /^[0-9]+(.[0-9]{1,2})?$/,
    COST: /^([1-9][0-9]*)+(.[0-9]{1,})?$/,
    ERRORCOST: /^[1-9]{1}[0-9]{0,}$/,
    AN: /^[A-Za-z0-9]+$/, // 数字和字母
    SOCIALCODE: /^([A-Za-z0-9]{15}|[A-Za-z0-9]{18})$/, // 统一社会信用代码
    COMPANYNAME: /[\u4E00-\u9FA5A-Za-z0-9\（\(\）\)]/, // 公司名称
    CHEN: /^[\u4E00-\u9FA5A-Za-z]+$/, // 汉字和英文
    NAME: /^[\u4E00-\u9FA5A-Za-z0-9]+$/, // 汉字、英文、数字
    IDNUMBER: /[a-zA-Z0-9]{18}/ ,//18位身份证数字或字母
    IDNUMBER1: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/, // 身份证15位
    IDNUMBER2: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/, // 身份证18位
    // TELPHONE : /^([0-9\-]+\,)*[0-9\-]+$/,  // 固话
    TELPHONE: /^((0\d{2}-\d{8})|(0\d{3}-\d{8}))$/, // 固话
    CARBRAND: /^([\u4E00-\u9FA5A-Za-z]{1,}[\u4E00-\u9FA5A-Za-z0-9]*)|([\u4E00-\u9FA5A-Za-z0-9]*[\u4E00-\u9FA5A-Za-z]{1,})$/, // 车辆品牌
    MOST_1: /^([1-9]{1}(.[0-9]{1})?)$|^(0.[1-9]{1})$/, // 请填入0~10之间的数字最多带一位小数
    NOTBOUND_6: /^[1-9]{1}[0-9]{0,5}$/, // 请填入大于0且不超过6位数的数字
    NUMBER: /^[0-9]+.?[0-9]*$/, // 数字
    VINCODE: /^[1-9WTJSKLVRYZ]{1}[A-HJ-NPR-Z0-9]{7}[0-9x]{1}[A-HJ-NPR-Z0-9]{8,9}$/,
    PLATENO: /^([A-Za-z0-9]{5})|([A-Za-z0-9]{4}[\u4E00-\u9FA5]{1})$/,
    EMAIL: /^([a-zA-Z0-9_-])+@([a-zA-Z0-9_-])+((\.[a-zA-Z0-9_-]{2,3}){1,2})$/, // 邮箱
    URL: /^(https?|ftp|file):\/\/[-A-Za-z0-9+&@#\/%?=~_|!:,.;]+[-A-Za-z0-9+&@#/%=~_|]$/, // 匹配url地址
    VINCODE: /^(?![^A-Z]+$)(?![^0-9]+$)[1-9WTJSKLVRYZ]{1}[A-HJ-NPR-Z0-9]{16}$/,	//VIN码(不能是纯数字或纯字母，第1位限定（1~9 or W,T,J,S,K,L,V,R,Y,Z）)
    SIMCARD: /^1[3|5|7|8][0-9]{9}$/,  //SIM卡号码
    PLATENO: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/, //车牌号
}
